print("----------------------12月份衣服销售数据------------------")
print("-----日期----服装名称----价格/件-------库存数量-----销售量---")
print("-----1号-----羽绒服------253.6-------500---------10------")
print("     2号	    牛仔裤	   86.3	       600	       60      ")
print("     3号	     风衣	    96.8	   335	       43      ")
print("     4号	     皮草	    135.9	   855	       63      ")
print("     5号	     T血	    65.8	   632	       63      ")
print("     6号	     衬衫	    49.3	   562	       120     ")
print("     7号	     牛仔裤	    86.3	   600	        72     ")
print("     8号	     羽绒服	    253.6	   500	       69      ")
print("     9号	     牛仔裤	    86.3	   600	       35      ")
print("     10号	 羽绒服	    253.6	   500	       140     ")
print("     11号	 牛仔裤	    86.3	   600	        90     ")
print("     12号	  皮草	    135.9	   855	        24     ")
print( "    13号	 T血	    65.8	   632	        45     ")
print("     14号	风衣	        96.8	   335	       25      ")
print("     15号	牛仔裤	    86.3	    600	       60      ")
print("     16号	  T血	    65.8	    632	        129    ")
print("     17号	羽绒服	    253.6	    500	        10     ")
print("     18号	风衣      	96.8	    335	        43     ")
print("     19号	T血	        65.8	    632	        63     ")
print("     20号	牛仔裤	     86.3	    600	        60     ")
print("     21号	皮草	         135.9	    855	        63     ")
print("     22号	风衣	         96.8	    335	        60     ")
print("     23号	T血	         65.8	    632     	58     ")
print("     24号	牛仔裤	     86.3	     600	    140    ")
print("     25号	 T血	     65.8	     632	    48     ")
print("     26号	  风衣	     96.8	     335	    43     ")
print("     27号	 皮草	      135.9	     855	    57     ")
print("     28号	羽绒服	      253.6	     500	     10    ")
print("     29号	 T血	      65.8	     632	     63    ")
print("     30号	 风衣	       96.8	     335	     78    ")
# 羽绒服销售总额:
a=253.6*(10+69+140+10+10)
# 牛仔裤销售总额:
b=86.3*(60+72+35+90+60+60+140)
# 风衣销售总额：
c=96.8*(43+25+43+60+43+78)
# 皮草销售总额
d=135.9*(63+24+63+57)
# T血销售总额
e=65.8*(63++45+63++48+129+58+63)
#  衬衫销售总额63+24+63+5
f=49.3*120
zong=a+b+c+d+e+f
print("总金额：",(zong),"￥")
print("羽绒服销售额占比",(100*a/zong),"%")
print("牛仔裤销售额占比",(100*b/zong),"%")
print("风衣销售总额占比",(100*c/zong),"%")
print("皮草销售总额占比",(100*d/zong),"%")
print("T血销售总额占比",(100*e/zong),"%")
print("衬衫销售总额占比",(100*f/zong),"%")

#羽绒服总件数
A=10+69+140+10+10
#牛仔裤总件数
B=60+72+35+90+60+60+140
#风衣销售总件数
C=43+25+43+60+43+78
#皮草销售总件数
D=63+24+63+57
#T血销售总件数
E=63++45+63++48+129+58+63
#衬衫销售总件数
F=120
#12月份销售总件数
H=A+B+C+D+E+F
print("羽绒服总件数占比",(100*A/H),"%")
print("牛仔裤总件数占比",(100*B/H),"%")
print("风衣总件数占比",(100*C/H),"%")
print("皮草总件数占比",(100*D/H),"%")
print("T血总件数占比",(100*E/H),"%")
print("衬衫总件数占比",(100*F/H),"%")

